{
    "desc_thickness" : "The thickness of a brain slice, assuming they'll all be the same.",

    "thickness" : 0.1,

    "desc_pixels_per_mm" : "How many pixels in the image corresponds to 1 mm? Assumed to apply equally to horz(y) and vert(z) directions.",

    "pixels_per_mm" : 233,

    "desc_scaleFactor" : "By what factor should the images given in 'slices' be scaled before they are shown in the UI. This is intended to allow you to scale down your images so that they fit within the resolution of your screen, or so that the data files generated by the program are kept in check. By scaling down the image size, the number of data points saved by the program is reduced, especially when 'save_per_pixel_data' is set true",
    "scaleFactor" : 1.0,

    "desc_bg_blur" : "bg_blur_screen_proportion is multiplied by the width of the image in pixels to get a sigma for the Gaussian which is used to blur the image to subtract the background.",

    "bg_blur_screen_proportion" : 0.1667,

    "desc_bg_blur_subtraction_offset" : "signal_img = 255 - (original_img + (bg_blur_subtraction_offset - blurred_bg)). Thus, possible range for bg_blur_subtraction_offset is 0 to 255.",

    "bg_blur_subtraction_offset" : 180,

    "desc_save_per_pixel_data" : "If true, then save out the signal values and coordinates of every individual pixel in each box and freehand loop. Not required to make surface maps and can lead to very large data files.",
    "save_per_pixel_data" : true,

    "desc_save_auto_align_data" : "Default is true. If false, then don't write coordinates in the autoaligned frame of reference into the HDF5 data file.",
    "save_auto_align_data" : true,

    "desc_save_landmark_align_data" : "Default is true. If false, then don't write coordinates in the landmark aligned frame of reference into the HDF5 data file.",
    "save_landmark_align_data" : true,

    "rotate_landmark_one" : true,

    "desc_map_align_angle" : "The angle, around the origin, at which to draw a line through the brain to use as the centre line for unwrapping the slice ribbons to make a 2D map",
    "map_align_angle" : 2,

    "desc_slices" : "The brain slices in the y-z plane, where y points to the anterior, z points dorsally (and so x is the lateral dimension).",
    "note_slices" : "In principle, need only one slice, but in practice, need two slices so that the autoalign process is carried out and the depth data is then recorded in the h5 file. I could hack the code, but it's easier to just put two slices in here.",
    "slices": [
	{ "filename" : "65_7E_id2/37.tif", "x" : 3.6 },
	{ "filename" : "65_7E_id2/38.tif", "x" : 3.8 }
    ]
}
